In [29]:
import pandas as pd
import numpy as np

In [30]:
df=pd.DataFrame([[4,'Ace , Jack, Queen'],
                [7,'Ace , King'],
                [9,'Jack , Queen, King']],
               columns=['feat1','faces'])
df

   feat1               faces
0      4   Ace , Jack, Queen
1      7          Ace , King
2      9  Jack , Queen, King

In [31]:
df.faces=df.faces.apply(lambda x: x.replace(' ','').split(','))
df

   feat1                faces
0      4   [Ace, Jack, Queen]
1      7          [Ace, King]
2      9  [Jack, Queen, King]

In [32]:
categories=list(set(df.faces.sum()))
categories

['Queen', 'Ace', 'Jack', 'King']

In [38]:
df_cat=pd.DataFrame(0,index=df.index,columns=categories)
df_cat

   Queen  Ace  Jack  King
0      0    0     0     0
1      0    0     0     0
2      0    0     0     0

In [43]:
for cat in categories:
    df_cat[cat]=df['faces'].apply(lambda face_list: int(cat in face_list))
df_cat

   Queen  Ace  Jack  King
0      1    1     1     0
1      0    1     0     1
2      1    0     1     1

In [44]:
df_x=pd.concat([df,df_cat],axis=1)
df_x

   feat1                faces  Queen  Ace  Jack  King
0      4   [Ace, Jack, Queen]      1    1     1     0
1      7          [Ace, King]      0    1     0     1
2      9  [Jack, Queen, King]      1    0     1     1

In [45]:
#we can package all of this into a function...

def explode(frame,cat_col,sep=','):
    '''inputs-
    frame: input dataframe
    cat_col: name of the category column
    sep: is the seperator between the catgories
    
    output-
    new dataframe with binary values for category columns
    '''
    df=frame.copy()
    df[cat_col]=df[cat_col].apply(lambda x: x.replace(' ','').split(sep))
    categories=list(set(df[cat_col].sum()))
    df_cat=pd.DataFrame(0,index=df.index,columns=categories)
    for cat in categories:
        df_cat[cat]=df[cat_col].apply(lambda cat_list: int(cat in cat_list))
    return pd.concat([df,df_cat],axis=1)

In [47]:
#test

restaurants=pd.DataFrame([[7,'French | Sushi| Deli'],
                [6,'Deli | Pizza'],
                [8,'Pizza | Sushi| Deli']],
               columns=['rating','cuisines'])

explode(restaurants,'cuisines',sep='|')

   rating               cuisines  Sushi  French  Pizza  Deli
0       7  [French, Sushi, Deli]      1       1      0     1
1       6          [Deli, Pizza]      0       0      1     1
2       8   [Pizza, Sushi, Deli]      1       0      1     1